In [48]:
from sklearn.metrics import precision_recall_fscore_support
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score
from sklearn.model_selection import train_test_split
from sklearn import tree
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np


# Let's import data from the Data folder - MB
train_set = pd.read_csv('Data/train.csv')
test_set = pd.read_csv('Data/test.csv')

train_set.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
def data_prep(set):
    set = set.drop(columns=['Name','Ticket', 'Fare', 'Cabin', 'PassengerId'])
    set = set.dropna()
    set['Sex'] = set['Sex'].replace('male', 1)
    set['Sex'] = set['Sex'].replace('female', 0)
    set['Embarked'] = set['Embarked'].replace('C', 0)
    set['Embarked'] = set['Embarked'].replace('S', 1)
    set['Embarked'] = set['Embarked'].replace('Q', 2)
    set['Age'] = set['Age'].astype(np.int64)
    return set

In [50]:
train_set = data_prep(train_set)
train_set

     Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0           0       3    1   22      1      0         1
1           1       1    0   38      1      0         0
2           1       3    0   26      0      0         1
3           1       1    0   35      1      0         1
4           0       3    1   35      0      0         1
..        ...     ...  ...  ...    ...    ...       ...
885         0       3    0   39      0      5         2
886         0       2    1   27      0      0         1
887         1       1    0   19      0      0         1
889         1       1    1   26      0      0         0
890         0       3    1   32      0      0         2

[712 rows x 7 columns]

In [51]:
test_set = data_prep(test_set)
test_set

     Pclass  Sex  Age  SibSp  Parch  Embarked
0         3    1   34      0      0         2
1         3    0   47      1      0         1
2         2    1   62      0      0         2
3         3    1   27      0      0         1
4         3    0   22      1      1         1
..      ...  ...  ...    ...    ...       ...
409       3    0    3      1      1         1
411       1    0   37      1      0         2
412       3    0   28      0      0         1
414       1    0   39      0      0         0
415       3    1   38      0      0         1

[332 rows x 6 columns]

In [52]:
train_set_survivors = train_set['Survived']
train_set = train_set.drop(columns=['Survived'])
train_set

     Pclass  Sex  Age  SibSp  Parch  Embarked
0         3    1   22      1      0         1
1         1    0   38      1      0         0
2         3    0   26      0      0         1
3         1    0   35      1      0         1
4         3    1   35      0      0         1
..      ...  ...  ...    ...    ...       ...
885       3    0   39      0      5         2
886       2    1   27      0      0         1
887       1    0   19      0      0         1
889       1    1   26      0      0         0
890       3    1   32      0      0         2

[712 rows x 6 columns]

In [85]:
# Big X, low y - convention
X_train, X_test, y_train, y_test = train_test_split(train_set, train_set_survivors, test_size=0.25, random_state=7)
train = tree.DecisionTreeClassifier(max_depth=5)
train.fit(X_train, y_train)

DecisionTreeClassifier(max_depth=5)

In [77]:
train.predict(test_set)

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1,
       0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 0], dtype=int64)

In [79]:
y_pred = train.predict(X_test)
print(precision_recall_fscore_support(y_test, y_pred, average='binary'))

(0.8035714285714286, 0.6617647058823529, 0.7258064516129031, None)

In [81]:
print(confusion_matrix(y_test,y_pred))

[[99 11]
 [23 45]]

In [82]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.81      0.90      0.85       110
           1       0.80      0.66      0.73        68

    accuracy                           0.81       178
   macro avg       0.81      0.78      0.79       178
weighted avg       0.81      0.81      0.80       178

In [83]:
print(accuracy_score(y_test, y_pred))

0.8089887640449438